In [ ]:
print("Alô Mundo!")

In [ ]:
! pip install sqlalchemy

In [ ]:
! pip install pandas
! pip install SQLAlchemy
! pip install pymysql

In [ ]:
import pandas as pd

In [ ]:
# Módulo
from sqlalchemy import create_engine

In [ ]:
! pip install pymysql

In [ ]:
import pymysql
import urllib.parse

In [ ]:
#definir as credencias
user = 'root'
password = urllib.parse.quote_plus('senai@123')
host = 'localhost'
database = 'schooltracker'

# criar uma url de conexão
connection_string = f'mysql+pymysql://{user}:{password}@{host}/{database}'
# criar a conexão  com o create_engine
engine = create_engine(connection_string)

# ecrever uma consulta  SQL
query_alunos = "SELECT * FROM aluno"

#criar o dataframe
df_alunosdf_alunos = pd.read_sql(query_alunos,engine)

#mostrar os cinco primeiros
df_alunos.head()

In [27]:
import pymysql
import urllib.parse
import sqlalchemy as sa
import pandas as pd

import pymysql
import urllib.parse
# definir as credenciais
user = 'root'
password = ''
host  = 'localhost'
database = 'schooltracker'
# criar uma url de conexão
connection_string = f'mysql+pymysql://{user}:{password}@{host}/{database}'
# criar a conexão com o create_engine()
engine = create_engine(connection_string)
# escrever uma consulta SQL
query_alunos = "SELECT * FROM aluno"
# criar o dataframe
df_alunos = pd.read_sql(query_alunos,engine)
# mostrar os cinco primeiros
df_alunos.head()

   id        ra            nome  tempoestudo  rendafamiliar
0   1         0            None            0            NaN
1   2  20230001       Ana Silva            6        2500.50
2   3  20230002     Bruno Costa            5        3000.75
3   4  20230003  Carlos Pereira            4        2000.00
4   5  20230004   Daniela Souza            7        3500.20